app/Controllers/Tipos.php

    public function index(){

        $acceso = $this->permisos->canView($this->oUser);
        if ($acceso) {
            $tipos = $this->Tipos_model->findAll();
---
SELECT *
FROM `tipos`